package zadacijavarash.uroven3lekciya3;

import java.util.Scanner;

/*
Напишем программу, в которой нужно вводить с клавиатуры целые числа
и считать их сумму, пока пользователь не введет слово "ENTER".
Вывести на экран полученную сумму и завершить программу.
Требования:
•	Программа должна считывать данные c клавиатуры.
•	Необходимо посчитать сумму введенных целых чисел и вывести её на экран, если пользователь ввел стоп слово.
•	В программе необходимо использовать цикл while.
 */
public class WhileExample3hard {
    public static void main(String[] args) {
//        Scanner scanner = new Scanner(System.in);
//        boolean notexit = true;
//        int sum = 0;
//        while (notexit) {
//            if (scanner.hasNextInt()) {
//                sum = sum + scanner.nextInt();
//            } else if (scanner.hasNextLine()) {
//                String m = scanner.nextLine();
//                if (m.equals("stop")){
//                    notexit = false;
//                }
//            }
//
//        }
//        System.out.println(sum);


//        Scanner scanner = new Scanner(System.in);
//        int sum = 0;
//        boolean isExit = false;
//        while (!isExit) {
//            if (scanner.hasNextInt()) {
//                int number = scanner.nextInt();
//                sum = sum + number;
//            } else if (scanner.hasNextLine()) {
//                String line = scanner.nextLine();
//                if (line.equals("ENTER")) {
//                    isExit = true;
//                }
//            }
//        }
//        System.out.println(sum);
//    }

    }
}