package Javahomework3;

import java.util.Arrays;

//2) Создайте массив из 5 случайных целых чисел из интервала [10;99]
//        Выведите его на экран в строку.
//        Определите и выведите на экран сообщение о том,
//        является ли массив строго возрастающей последовательностью. (отредактировано)
public class Example2 {
    public static void main(String[] args) {
        int[] arrays = {14,22,33,44,66};
        System.out.println(Arrays.toString(arrays));

            
        }
    }
    


