package zadacijavarash.uroven3lekciya9;

import java.util.Scanner;

/*
Для решения этой задачи нужно:

Ввести с клавиатуры положительное целое число radius. Это будет радиус окружности.
Вывести на экран площадь круга, рассчитанную по формуле: S = pi * radius * radius.
Результатом должно стать целое число (тип int).
Для этого нужно привести к типу int результат умножения (отбросить дробную часть, округлив вниз до целого числа).
В качестве значения pi используй 3.14.
Требования:
•	Программа должна считывать целое число c клавиатуры.
•	Программа должна выводить число на экран.
•	Программа должна выводить на экран площадь круга радиусом radius, приведенную к целому числу.
Пример ввода:
5

Пример вывода:
78
 */
public class PloshadKruga {
    public static void main(String[] args) {
//        Scanner scanner = new Scanner(System.in);
//        int radius = scanner.nextInt();
//        double s = 3.14 * radius *radius;
//        System.out.println((int)s);
        double d = 5.0 / 2;
        System.out.println(d);
    }
}
